<?
/*$x = (10>3);//true
echo $x;*/

$a = 10;
$a = $a+1;//11
$a++;//постфиксная форма инкремента
++$a;
$a+=1;
$a*=3;
$a=$a*3;

$b = 10;
$b = $b % 3;
//echo $b;
//echo $a;

//Операторы условия

/*define("MY_CONST",1);
echo MY_CONST;*/

//const MY_CONST = 10;

$a = 10;
$b="10";
$res = ($a===$b);
//echo $res;//false


//Преобразование одного типа данных к другому

$x = 25.345;//float
//var_dump($x);

$x = (int)$x;
//echo $x;

$x2 = "п2ример";
$y = 3 + $x2;
//echo $y;
/*
echo "Переменная ".$y." это число<hr>";
echo 'Переменная $y это число';
*/

//Экранирование символов

$text = "\$yПроект \"САОС\" - один из самых успешных проектов";
//echo $text;

//Постфиксная форма инкремента

$a = 10;
$b = $a++;
//echo "\$a=$a<br>\$b=$b";

//Префиксная форма инкремента

$a = 10;
$b = ++$a;
echo "\$a=$a<br>\$b=$b";

$s *=5;//$s = $s*5;

$x=1;
$list = "<ul>";
$list.="<li>$x</li>";
$list.="<li>".++$x."</li>";
$list.="<li>".++$x."</li>";
$list.="</ul>";

echo $list;


$a = 9;
$res1 = sqrt($a);//3
$res2 = pow($a,3);//2...










